Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/reference-react-dom-server_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: The `ReactDOMServer` object enables you to render components to static markup.
ja: `ReactDOMServer` オブジェクトはコンポーネントを静的なマークアップとして変換できるようにします。

source: Typically, it's used on a Node server:
ja: これは、一般的に Node サーバで使われます。

source: ## Overview {#overview}
ja: ## 概要 {#overview}

source: The following methods can be used in both the server and browser environments:
ja: 以下のメソッドはサーバとブラウザの両方の環境で使用できます：

source: These additional methods depend on a package (`stream`) that is **only available on the server**, and won't work in the browser.
ja: 以下の追加のメソッドは**サーバでのみ利用可能な**パッケージ (`stream`) に依存しているため、ブラウザでは動作しません。

source: ## Reference {#reference}
ja: ## リファレンス {#reference}

source: Render a React element to its initial HTML.
ja: React 要素を初期状態の HTML へと変換します。

source: React will return an HTML string.
ja: React は HTML 文字列を返します。

source: You can use this method to generate HTML on the server and send the markup down on the initial request for faster page loads and to allow search engines to crawl your pages for SEO purposes.
ja: このメソッドにより、サーバ上で HTML を生成して最初のリクエストに対してマークアップを送信してページ読み込み速度を向上させたり、また SEO 目的で検索エンジンがページを巡回することを可能にします。

source: If you call [`ReactDOM.hydrate()`](/docs/react-dom.html#hydrate) on a node that already has this server-rendered markup, React will preserve it and only attach event handlers, allowing you to have a very performant first-load experience.
ja: このようにしてサーバ側で変換されたマークアップをあらかじめ持つノード上で [`ReactDOM.hydrate()`](/docs/react-dom.html#hydrate) を呼び出した場合、React はマークアップを保持しつつイベントハンドラのみを追加するので、非常にパフォーマンスの高い初回ページロードの体験が得られます。

source: Similar to [`renderToString`](#rendertostring), except this doesn't create extra DOM attributes that React uses internally, such as `data-reactroot`.
ja: React が内部的に使用する `data-reactroot` のような追加の DOM 属性を作成しないことを除いて、[`renderToString`](#rendertostring) と同様の動作をします。

source: This is useful if you want to use React as a simple static page generator, as stripping away the extra attributes can save some bytes.
ja: このメソッドは React を単純な静的サイトジェネレータとして使用したい場合に便利で、追加の属性を省略することでバイト数を削減できます。

source: If you plan to use React on the client to make the markup interactive, do not use this method.
ja: マークアップをインタラクティブなものにするために、クライアントで React を導入しようとしている場合は、このメソッドを使用しないでください。

source: Instead, use [`renderToString`](#rendertostring) on the server and [`ReactDOM.hydrate()`](/docs/react-dom.html#hydrate) on the client.
ja: 代わりに、サーバで [`renderToString`](#rendertostring) を、そしてクライアントで [`ReactDOM.hydrate()`](/docs/react-dom.html#hydrate) を使用してください。

source: Returns a [Readable stream](https://nodejs.org/api/stream.html#stream_readable_streams) that outputs an HTML string.
ja: HTML の文字列を出力する [Readable ストリーム](https://nodejs.org/api/stream.html#stream_readable_streams)を返します。

source: The HTML output by this stream is exactly equal to what [`ReactDOMServer.renderToString`](#rendertostring) would return.
ja: このストリームによる HTML 出力は [`ReactDOMServer.renderToString`](#rendertostring) が返すものと全く同じです。

source: > Note: > > Server-only.
ja: > 補足： > > この API はサーバ専用です。

source: This API is not available in the browser.
ja: ブラウザでは利用できません。

source: > > The stream returned from this method will return a byte stream encoded in utf-8.
ja: > > このメソッドが返すストリームは UTF-8 でエンコードされたバイトストリームを返します。

source: If you need a stream in another encoding, take a look at a project like [iconv-lite](https://www.npmjs.com/package/iconv-lite), which provides transform streams for transcoding text.
ja: 別の方式でエンコードされたストリームが必要な場合、テキストのトランスコーディングのためにストリーム変換を提供している [iconv-lite](https://www.npmjs.com/package/iconv-lite) のようなプロジェクトを参照してください。

source: Similar to [`renderToNodeStream`](#rendertonodestream), except this doesn't create extra DOM attributes that React uses internally, such as `data-reactroot`.
ja: React が内部的に使用する `data-reactroot` のような追加の DOM 属性を作成しないことを除いて、[`renderToNodeStream`](#rendertonodestream) と同様の動作をします。

source: The HTML output by this stream is exactly equal to what [`ReactDOMServer.renderToStaticMarkup`](#rendertostaticmarkup) would return.
ja: このストリームによる HTML 出力は [`ReactDOMServer.renderToStaticMarkup`](#rendertostaticmarkup) が返すものと全く同じです。

source: Instead, use [`renderToNodeStream`](#rendertonodestream) on the server and [`ReactDOM.hydrate()`](/docs/react-dom.html#hydrate) on the client.
ja: 代わりに、サーバで [`renderToNodeStream`](#rendertonodestream) を、そしてクライアントで [`ReactDOM.hydrate()`](/docs/react-dom.html#hydrate) を使用してください。
